STMicroelectronics/STM32CubeH7/Projects/NUCLEO-H743ZI/Applications/LwIP/LwIP_HTTP_Server_Netconn_RTOS/Src/ethernetif.c
  return 0;
}

/**
  * @brief  Get the time in millisecons used for internal PHY driver process.
  * @retval Time value
  */
int32_t ETH_PHY_IO_GetTick(void)
{
  return HAL_GetTick();
}

/**
  * @brief  Check the ETH link state and update netif accordingly.
  * @param  argument: netif
  * @retval None
  */
void ethernet_link_thread( void const * argument )
{
  ETH_MACConfigTypeDef MACConf = {0};
  int32_t PHYLinkState = 0U;
  int32_t PHYLinkState_prev = 0U;
  uint32_t link_ok = 0U, speed = 0U, duplex = 0U;
  struct netif *netif = (struct netif *) argument;

  for(;;)
  {
    PHYLinkState_prev = PHYLinkState;
    PHYLinkState = LAN8742_GetLinkState(&LAN8742);
    switch (PHYLinkState)
    {
    case LAN8742_STATUS_100MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      link_ok = 1;
      break;
    case LAN8742_STATUS_100MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      link_ok = 1;
      break;
    case LAN8742_STATUS_10MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      link_ok = 1;
      break;
    case LAN8742_STATUS_10MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      link_ok = 1;
      break;
    default:
  	  link_ok = 0;
      break;
    }

    if(!link_ok){
      if(netif_is_link_up(netif)){
        link_ok = 0;
        LOCK_TCPIP_CORE(); /* required by netif_set_down */
        osMutexWait (RxTxMutex, osWaitForever);
        ETH_critical_enter();
        HAL_ETH_Stop_IT(&EthHandle);
        ETH_critical_exit();
        netif_set_down(netif);
        netif_set_link_down(netif);
        osMutexRelease (RxTxMutex);
        UNLOCK_TCPIP_CORE();
        /* unblock blocking waits to be on safe side */
        osSemaphoreRelease(RxPktSemaphore);
        osMessagePut(TxPktSemaphoreQ,ERR_IF,0);
      }
    }
    else {
      /* link ok */
      if(!netif_is_link_up(netif) || (PHYLinkState_prev != PHYLinkState))
      {
    	/* we need to update mac also when PHYLinkState changes */
   	    LOCK_TCPIP_CORE();
   	    osMutexWait (RxTxMutex, osWaitForever);
   	    ETH_critical_enter();
   	    HAL_ETH_Stop_IT(&EthHandle);
        HAL_ETH_GetMACConfig(&EthHandle, &MACConf);
        MACConf.DuplexMode = duplex;
        MACConf.Speed = speed;
        HAL_ETH_SetMACConfig(&EthHandle, &MACConf);
        HAL_ETH_Start_IT(&EthHandle);
        ETH_critical_exit();
        netif_set_up(netif);
        netif_set_link_up(netif);
        osMutexRelease (RxTxMutex);
        UNLOCK_TCPIP_CORE();
        /* unblock blocking waits to be on safe side */
        osSemaphoreRelease(RxPktSemaphore);
        osMessagePut(TxPktSemaphoreQ,ERR_IF,0);
      }
    }

    osDelay(100);
  }
}

void HAL_ETH_RxAllocateCallback(uint8_t **buff)
{
  struct pbuf_custom *p = LWIP_MEMPOOL_ALLOC(RX_POOL);
  if (p)
  {
    /* Get the buff from the struct pbuf address. */
    *buff = (uint8_t *)p + offsetof(RxBuff_t, buff);
    p->custom_free_function = pbuf_free_custom;
    /* Initialize the struct pbuf.
    * This must be performed whenever a buffer's allocated because it may be
    * changed by lwIP or the app, e.g., pbuf_free decrements ref. */
    pbuf_alloced_custom(PBUF_RAW, 0, PBUF_REF, p, *buff, ETH_RX_BUFFER_SIZE);
  }
  else
  {
    RxAllocStatus = RX_ALLOC_ERROR;
    *buff = NULL;
  }
}

void HAL_ETH_RxLinkCallback(void **pStart, void **pEnd, uint8_t *buff, uint16_t Length)
{
  struct pbuf **ppStart = (struct pbuf **)pStart;
  struct pbuf **ppEnd = (struct pbuf **)pEnd;
  struct pbuf *p = NULL;

  /* Get the struct pbuf from the buff address. */
  p = (struct pbuf *)(buff - offsetof(RxBuff_t, buff));
  p->next = NULL;
  p->tot_len = 0;
  p->len = Length;

  /* Chain the buffer. */
  if (!*ppStart)
  {
    /* The first buffer of the packet. */
    *ppStart = p;
  }
  else
  {
    /* Chain the buffer to the end of the packet. */
    (*ppEnd)->next = p;
  }
  *ppEnd  = p;

  /* Update the total length of all the buffers of the chain. Each pbuf in the chain should have its tot_len
   * set to its own length, plus the length of all the following pbufs in the chain. */
  for (p = *ppStart; p != NULL; p = p->next)
  {
    p->tot_len += Length;
  }

  /* Invalidate data cache because Rx DMA's writing to physical memory makes it stale. */
  SCB_InvalidateDCache_by_Addr((uint32_t *)buff, Length);
}

void HAL_ETH_TxFreeCallback(uint32_t * buff)
{
  pbuf_free((struct pbuf *)buff);
}

static volatile int ETH_critical_enter_cnt;
static void ETH_critical_enter(){
  HAL_NVIC_DisableIRQ(ETH_IRQn);
  // this function supports recursive reentrance, but it should not happen
  LWIP_ASSERT("ETH_critical_enter_cnt < 1" , ETH_critical_enter_cnt < 1 );
  ETH_critical_enter_cnt+=1;
}

static void ETH_critical_exit(){
  LWIP_ASSERT("ETH_critical_enter_cnt >= 1" , ETH_critical_enter_cnt >= 1);
  ETH_critical_enter_cnt -= 1;
  if(ETH_critical_enter_cnt == 0){
    HAL_NVIC_EnableIRQ(ETH_IRQn);
  }
}

